In [1]:
%load_ext sql
%sql postgresql://retail_user:retail_password@localhost:5432/retail_db
%sql SELECT current_database()

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[('retail_db',)]

In [2]:
%%sql
CREATE OR REPLACE VIEW 
    orders_v
AS
    SELECT * FROM orders

 * postgresql://retail_user:***@localhost:5432/retail_db
Done.

[]

In [3]:
%%sql
CREATE VIEW 
    orders_v
AS
    SELECT * FROM orders

 * postgresql://retail_user:***@localhost:5432/retail_db
(psycopg2.errors.DuplicateTable) relation "orders_v" already exists

[SQL: CREATE VIEW
    orders_v
AS
    SELECT * FROM orders]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [5]:
%%sql
SELECT * FROM information_schema.tables WHERE table_name ~ 'orders'

 * postgresql://retail_user:***@localhost:5432/retail_db
2 rows affected.

[('retail_db', 'public', 'orders', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('retail_db', 'public', 'orders_v', 'VIEW', None, None, None, None, None, 'YES', 'NO', None)]

In [7]:
%%sql
CREATE OR REPLACE VIEW 
    order_details_v 
AS 
    SELECT * FROM orders o JOIN order_items oi on o.order_id = oi.order_item_order_id

 * postgresql://retail_user:***@localhost:5432/retail_db
Done.

[]

In [11]:
%%sql
SELECT * FROM order_details_v LIMIT 10

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'CLOSED', 1, 1, 957, 1, 299.98, 299.98),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 256, 'PENDING_PAYMENT', 2, 2, 1073, 1, 199.99, 199.99),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 256, 'PENDING_PAYMENT', 3, 2, 502, 5, 250.0, 50.0),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 256, 'PENDING_PAYMENT', 4, 2, 403, 1, 129.99, 129.99),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED', 5, 4, 897, 2, 49.98, 24.99),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED', 6, 4, 365, 5, 299.95, 59.99),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED', 7, 4, 502, 3, 150.0, 50.0),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED', 8, 4, 1014, 4, 199.92, 49.98),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE', 9, 5, 957, 1, 299.98, 299.98),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE', 10, 5, 365, 5, 299.95, 59.99)]

In [12]:
%%sql

SELECT order_date,
    order_item_product_id,
    round(sum(order_item_subtotal)::numeric, 2) AS revenue
FROM order_details_v 
GROUP BY order_date,
    order_item_product_id
ORDER BY order_date,
    revenue DESC
LIMIT 10

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 1004, Decimal('10799.46')),
 (datetime.datetime(2013, 7, 25, 0, 0), 957, Decimal('9599.36')),
 (datetime.datetime(2013, 7, 25, 0, 0), 191, Decimal('8499.15')),
 (datetime.datetime(2013, 7, 25, 0, 0), 365, Decimal('7558.74')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1073, Decimal('6999.65')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1014, Decimal('6397.44')),
 (datetime.datetime(2013, 7, 25, 0, 0), 403, Decimal('5589.57')),
 (datetime.datetime(2013, 7, 25, 0, 0), 502, Decimal('5100.00')),
 (datetime.datetime(2013, 7, 25, 0, 0), 627, Decimal('2879.28')),
 (datetime.datetime(2013, 7, 25, 0, 0), 226, Decimal('599.99'))]

### SUBQUERIES

In [3]:
%%sql
SELECT * FROM (SELECT order_date, order_status FROM orders) as q LIMIT 10

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED'),
 (datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT'),
 (datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE'),
 (datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED'),
 (datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE'),
 (datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE'),
 (datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE'),
 (datetime.datetime(2013, 7, 25, 0, 0), 'PROCESSING'),
 (datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT'),
 (datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT')]

In [10]:
%%sql
SELECT COUNT(*) FROM order_items

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(172198,)]

In [13]:
%%sql
SELECT * FROM order_items oi
WHERE oi.order_item_order_id IN
(SELECT order_id FROM orders) LIMIT 10

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(1, 1, 957, 1, 299.98, 299.98),
 (2, 2, 1073, 1, 199.99, 199.99),
 (3, 2, 502, 5, 250.0, 50.0),
 (4, 2, 403, 1, 129.99, 129.99),
 (5, 4, 897, 2, 49.98, 24.99),
 (6, 4, 365, 5, 299.95, 59.99),
 (7, 4, 502, 3, 150.0, 50.0),
 (8, 4, 1014, 4, 199.92, 49.98),
 (9, 5, 957, 1, 299.98, 299.98),
 (10, 5, 365, 5, 299.95, 59.99)]

In [15]:
%%sql
SELECT * FROM order_items oi
WHERE EXISTS (
        SELECT 1 FROM orders o
        WHERE o.order_id = oi.order_item_order_id
    )
LIMIT 10

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(1, 1, 957, 1, 299.98, 299.98),
 (2, 2, 1073, 1, 199.99, 199.99),
 (3, 2, 502, 5, 250.0, 50.0),
 (4, 2, 403, 1, 129.99, 129.99),
 (5, 4, 897, 2, 49.98, 24.99),
 (6, 4, 365, 5, 299.95, 59.99),
 (7, 4, 502, 3, 150.0, 50.0),
 (8, 4, 1014, 4, 199.92, 49.98),
 (9, 5, 957, 1, 299.98, 299.98),
 (10, 5, 365, 5, 299.95, 59.99)]

In [16]:
%%sql

CREATE TABLE customer_order_metrics_mthly (
    customer_id INT,
    order_month CHAR(7),
    order_count INT,
    order_revenue FLOAT
)

 * postgresql://retail_user:***@localhost:5432/retail_db
Done.

[]

In [17]:
%%sql

ALTER TABLE customer_order_metrics_mthly
    ADD PRIMARY KEY (order_month, customer_id)

 * postgresql://retail_user:***@localhost:5432/retail_db
Done.

[]

In [18]:
%%sql

SELECT o.order_customer_id,
    to_char(o.order_date, 'yyyy-MM') AS order_month,
    count(1) AS order_count,
    round(sum(order_item_subtotal)::numeric, 2) AS order_revenue
FROM orders o 
    JOIN order_items oi
        ON o.order_id = oi.order_item_order_id
GROUP BY o.order_customer_id,
    to_char(o.order_date, 'yyyy-MM')
ORDER BY order_month,
    order_count DESC
LIMIT 10

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(5293, '2013-07', 10, Decimal('2781.73')),
 (4257, '2013-07', 10, Decimal('2059.75')),
 (9103, '2013-07', 9, Decimal('1587.85')),
 (7473, '2013-07', 9, Decimal('1244.90')),
 (32, '2013-07', 9, Decimal('2009.75')),
 (488, '2013-07', 9, Decimal('1365.82')),
 (7073, '2013-07', 9, Decimal('1377.83')),
 (2071, '2013-07', 9, Decimal('1629.84')),
 (1498, '2013-07', 8, Decimal('1619.88')),
 (1780, '2013-07', 8, Decimal('1651.85'))]

In [19]:
%%sql

INSERT INTO customer_order_metrics_mthly
SELECT o.order_customer_id,
    to_char(o.order_date, 'yyyy-MM') AS order_month,
    count(1) order_count,
    NULL
FROM orders o 
    JOIN order_items oi
        ON o.order_id = oi.order_item_order_id
GROUP BY o.order_customer_id,
    to_char(o.order_date, 'yyyy-MM')

 * postgresql://retail_user:***@localhost:5432/retail_db
48059 rows affected.

[]

In [20]:
%%sql

SELECT * FROM customer_order_metrics_mthly
ORDER BY order_month,
    customer_id
LIMIT 10

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(12, '2013-07', 2, None),
 (16, '2013-07', 1, None),
 (17, '2013-07', 2, None),
 (19, '2013-07', 3, None),
 (32, '2013-07', 9, None),
 (45, '2013-07', 4, None),
 (48, '2013-07', 4, None),
 (54, '2013-07', 2, None),
 (58, '2013-07', 4, None),
 (64, '2013-07', 2, None)]

In [21]:
%%sql

UPDATE customer_order_metrics_mthly comd
SET 
    (order_count, order_revenue) = (
        SELECT count(1),
            round(sum(order_item_subtotal)::numeric, 2)
        FROM orders o 
            JOIN order_items oi
                ON o.order_id = oi.order_item_order_id
        WHERE o.order_customer_id = comd.customer_id
            AND to_char(o.order_date, 'yyyy-MM') = comd.order_month
            AND to_char(o.order_date, 'yyyy-MM') = '2013-08'
            AND comd.order_month = '2013-08'
        GROUP BY o.order_customer_id,
            to_char(o.order_date, 'yyyy-MM')
    )
WHERE EXISTS (
    SELECT 1 FROM orders o
    WHERE o.order_customer_id = comd.customer_id
        AND to_char(o.order_date, 'yyyy-MM') = comd.order_month
        AND to_char(o.order_date, 'yyyy-MM') = '2013-08'
) AND comd.order_month = '2013-08'

 * postgresql://retail_user:***@localhost:5432/retail_db
3935 rows affected.

[]

In [22]:
%%sql

SELECT * FROM customer_order_metrics_mthly
WHERE order_month = '2013-08'
ORDER BY order_month,
    customer_id
LIMIT 10

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(2, '2013-08', 5, 769.82),
 (13, '2013-08', 5, 1065.93),
 (14, '2013-08', 3, 459.97),
 (18, '2013-08', 1, 129.99),
 (20, '2013-08', 2, 739.91),
 (22, '2013-08', 5, 769.96),
 (24, '2013-08', 2, 399.91),
 (25, '2013-08', 1, 129.99),
 (33, '2013-08', 3, 929.92),
 (34, '2013-08', 4, 789.92)]

In [23]:
%%sql

DROP TABLE IF EXISTS customers_backup

 * postgresql://retail_user:***@localhost:5432/retail_db
Done.

[]

In [24]:
%%sql

CREATE TABLE customers_backup
AS
SELECT * FROM customers

 * postgresql://retail_user:***@localhost:5432/retail_db
12435 rows affected.

[]

In [25]:
%%sql

SELECT count(1) FROM customers_backup c
    LEFT OUTER JOIN orders o
        ON c.customer_id = o.order_customer_id
WHERE o.order_customer_id IS NULL

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(30,)]

In [26]:
%%sql

SELECT count(1) FROM customers_backup c
WHERE NOT EXISTS (
    SELECT 1 FROM orders o
    WHERE c.customer_id = o.order_customer_id
)

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(30,)]

In [27]:
%%sql

DELETE FROM customers_backup c
WHERE NOT EXISTS (
    SELECT 1 FROM orders o
    WHERE c.customer_id = o.order_customer_id
)

 * postgresql://retail_user:***@localhost:5432/retail_db
30 rows affected.

[]

In [28]:
%%sql

SELECT count(1) FROM customers_backup

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(12405,)]

In [29]:
%%sql

DELETE FROM customers_backup c
WHERE customer_id NOT IN (
    SELECT order_customer_id FROM orders o
)

 * postgresql://retail_user:***@localhost:5432/retail_db
0 rows affected.

[]

In [30]:
%%sql

CREATE TABLE customer_order_metrics_dly (
    customer_id INT,
    order_date DATE,
    order_count INT,
    order_revenue FLOAT
)

 * postgresql://retail_user:***@localhost:5432/retail_db
Done.

[]

In [31]:
%%sql

ALTER TABLE customer_order_metrics_dly
    ADD PRIMARY KEY (customer_id, order_date)

 * postgresql://retail_user:***@localhost:5432/retail_db
Done.

[]

In [32]:
%%sql

INSERT INTO customer_order_metrics_dly
SELECT o.order_customer_id,
    o.order_date,
    count(1) order_count,
    NULL
FROM orders o 
    JOIN order_items oi
        ON o.order_id = oi.order_item_order_id
WHERE o.order_date BETWEEN '2013-08-01' AND '2013-08-31'
GROUP BY o.order_customer_id,
    o.order_date

 * postgresql://retail_user:***@localhost:5432/retail_db
4708 rows affected.

[]

In [33]:
%%sql

UPDATE customer_order_metrics_dly comd
SET 
    (order_count, order_revenue) = (
        SELECT count(1),
            round(sum(oi.order_item_subtotal)::numeric, 2)
        FROM orders o 
            JOIN order_items oi
                ON o.order_id = oi.order_item_order_id
        WHERE o.order_date BETWEEN '2013-08-01' AND '2013-10-31'
            AND o.order_customer_id = comd.customer_id
            AND o.order_date = comd.order_date
        GROUP BY o.order_customer_id,
            o.order_date
    )
WHERE comd.order_date BETWEEN '2013-08-01' AND '2013-10-31'

 * postgresql://retail_user:***@localhost:5432/retail_db
4708 rows affected.

[]

In [35]:
%%sql

INSERT INTO customer_order_metrics_dly
SELECT o.order_customer_id AS customer_id,
    o.order_date,
    count(1) order_count,
    round(sum(order_item_subtotal)::numeric, 2)
FROM orders o 
    JOIN order_items oi
        ON o.order_id = oi.order_item_order_id
WHERE o.order_date BETWEEN '2013-08-01' AND '2013-10-31'
    AND NOT EXISTS (
        SELECT 1 FROM customer_order_metrics_dly codm
        WHERE o.order_customer_id = codm.customer_id
            AND o.order_date = codm.order_date
    )
GROUP BY o.order_customer_id,
    o.order_date

 * postgresql://retail_user:***@localhost:5432/retail_db
9265 rows affected.

[]

In [36]:
%%sql

SELECT to_char(order_date, 'yyyy-MM'), count(1) FROM customer_order_metrics_dly
GROUP BY to_char(order_date, 'yyyy-MM')
LIMIT 10

 * postgresql://retail_user:***@localhost:5432/retail_db
3 rows affected.

[('2013-08', 4708), ('2013-10', 4417), ('2013-09', 4848)]

In [37]:
%sql TRUNCATE TABLE customer_order_metrics_dly

 * postgresql://retail_user:***@localhost:5432/retail_db
Done.

[]

In [38]:
%%sql
SELECT * FROM customer_order_metrics_dly

 * postgresql://retail_user:***@localhost:5432/retail_db
0 rows affected.

[]

In [39]:
%%sql

INSERT INTO customer_order_metrics_dly
SELECT o.order_customer_id,
    o.order_date,
    count(1) order_count,
    NULL
FROM orders o 
    JOIN order_items oi
        ON o.order_id = oi.order_item_order_id
WHERE o.order_date BETWEEN '2013-08-01' AND '2013-08-31'
GROUP BY o.order_customer_id,
    o.order_date

 * postgresql://retail_user:***@localhost:5432/retail_db
4708 rows affected.

[]

In [40]:
%%sql

ALTER TABLE customer_order_metrics_dly DROP CONSTRAINT customer_order_metrics_dly_pkey

 * postgresql://retail_user:***@localhost:5432/retail_db
Done.

[]

In [41]:
%%sql

ALTER TABLE customer_order_metrics_dly
    ADD PRIMARY KEY (customer_id, order_date)

 * postgresql://retail_user:***@localhost:5432/retail_db
Done.

[]

In [42]:
%%sql

INSERT INTO customer_order_metrics_dly
SELECT o.order_customer_id,
    o.order_date,
    count(1) order_count,
    round(sum(order_item_subtotal)::numeric, 2) AS order_revenue
FROM orders o 
    JOIN order_items oi
        ON o.order_id = oi.order_item_order_id
WHERE o.order_date BETWEEN '2013-08-01' AND '2013-10-31'
GROUP BY o.order_customer_id,
    o.order_date
ON CONFLICT (customer_id, order_date) DO UPDATE SET
    order_count = EXCLUDED.order_count,
    order_revenue = EXCLUDED.order_revenue

 * postgresql://retail_user:***@localhost:5432/retail_db
13973 rows affected.

[]

In [43]:
%%sql

SELECT to_char(order_date, 'yyyy-MM'), count(1) FROM customer_order_metrics_dly
GROUP BY to_char(order_date, 'yyyy-MM')
LIMIT 10

 * postgresql://retail_user:***@localhost:5432/retail_db
3 rows affected.

[('2013-08', 4708), ('2013-09', 4848), ('2013-10', 4417)]

In [45]:
%%sql
SELECT 
    column_name, 
    data_type, 
    character_maximum_length,
    is_nullable,
    column_default
FROM 
    information_schema.columns
WHERE 
    table_name = 'order_items';

 * postgresql://retail_user:***@localhost:5432/retail_db
6 rows affected.

[('order_item_id', 'integer', None, 'NO', None),
 ('order_item_order_id', 'integer', None, 'NO', None),
 ('order_item_product_id', 'integer', None, 'NO', None),
 ('order_item_quantity', 'integer', None, 'NO', None),
 ('order_item_subtotal', 'double precision', None, 'NO', None),
 ('order_item_product_price', 'double precision', None, 'NO', None)]

In [48]:
%%sql
SELECT * FROM information_schema.tables WHERE table_schema ~ 'public'

 * postgresql://retail_user:***@localhost:5432/retail_db
12 rows affected.

[('retail_db', 'public', 'departments', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('retail_db', 'public', 'categories', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('retail_db', 'public', 'products', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('retail_db', 'public', 'customers', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('retail_db', 'public', 'orders', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('retail_db', 'public', 'order_items', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('retail_db', 'public', 'customer_order_metrics_mthly', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('retail_db', 'public', 'customers_backup', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('retail_db', 'public', 'customer_order_metrics_dly', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('retail_db', 'public', 'users', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('retail_db', 'public', 'orders_v', 'VIEW', None, None, None, None, None, 'YES', 'NO', None),
 ('retail_db', 'public', 'order_details_v', 'VIEW', None, None, None, None, None, 'NO', 'NO', None)]